public class Task1 {
    public static void main (String[] args){
//Написать первую программу, которая выводит в консоль строку “Hello World!”.
        System.out.println("Hello World!");
    }
}
